docs/xmldata/cimquery.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:b="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd">
    <s:Header>
        <a:To>http://192.168.0.121:5985/wsman</a:To>
        <w:ResourceURI s:mustUnderstand="true">http://schemas.dmtf.org/wbem/cim-xml/2/cim-schema/2/*</w:ResourceURI>
        <a:ReplyTo>
            <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
        </a:ReplyTo>
        <a:Action s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/enumeration/Enumerate</a:Action>
        <w:MaxEnvelopeSize s:mustUnderstand="true">512000</w:MaxEnvelopeSize>
        <a:MessageID>uuid:FF2CF18E-0F75-4754-98F1-94F4D52D8DBF</a:MessageID>
        <w:Locale xml:lang="en-US" s:mustUnderstand="false" />
        <p:DataLocale xml:lang="en-US" s:mustUnderstand="false" />
        <p:SessionId s:mustUnderstand="false">uuid:72398EF0-91A4-401A-9569-E61C0FE6D6B2</p:SessionId>
        <p:OperationID s:mustUnderstand="false">uuid:67EA9B60-C0F0-490E-B372-1E8FFCFEF38E</p:OperationID>
        <p:SequenceId s:mustUnderstand="false">1</p:SequenceId>
        <w:SelectorSet>
            <w:Selector Name="__cimnamespace">root/cimv2</w:Selector>
            <w:Selector Name="ClassName"></w:Selector>
        </w:SelectorSet>
        <w:OptionSet xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <w:Option Name="IncludeInheritanceHierarchy" Type="xs:boolean">true</w:Option>
            <w:Option Name="IncludeInheritedElements" Type="xs:boolean">true</w:Option>
            <w:Option Name="IncludeQualifiers" Type="xs:boolean">true</w:Option>
            <w:Option Name="__MI_CallbackRegistration" Type="xs:int">11</w:Option>
            <w:Option Name="wmiarray:__MI_OPERATIONOPTIONS_CHANNELVALUE" Type="xs:unsignedInt">0</w:Option>
            <w:Option Name="wmiarray:__MI_OPERATIONOPTIONS_CHANNELVALUE" Type="xs:unsignedInt">1</w:Option>
            <w:Option Name="wmiarray:__MI_OPERATIONOPTIONS_CHANNELVALUE" Type="xs:unsignedInt">2</w:Option>
            <w:Option Name="wmi:__MI_OPERATIONOPTIONS_WRITEERRORMODE" Type="xs:unsignedInt">1</w:Option>
            <w:Option Name="msftwinrm:UsePreciseArrays" Type="xs:boolean">true</w:Option>
        </w:OptionSet>
    </s:Header>
    <s:Body>
        <n:Enumerate>
            <w:OptimizeEnumeration />
            <w:MaxElements>32000</w:MaxElements>
        </n:Enumerate>
    </s:Body>
</s:Envelope>